diverta/onecard-fido/nRF5_SDK_v13.0.0/examples/diverta/one_card_peripheral_app/main.c
/*
 * button.
 */
#define APP_BUTTON_NUM                  2
#define APP_BUTTON_DELAY                APP_TIMER_TICKS(100)
#define APP_BUTTON_ACTION_PUSH          APP_BUTTON_PUSH                             /**< Represents pushing a button. */
#define APP_BUTTON_ACTION_RELEASE       APP_BUTTON_RELEASE                          /**< Represents releasing a button. */
#define APP_BUTTON_ACTION_LONG_PUSH     2                                           /**< Represents pushing and holding a button. */

/*
 * ble : service
 *     # Device Information Service.
 */
#define MANUFACTURER_NAME				"Diverta,Inc"								/**< Manufacturer. Will be passed to Device Information Service. */
#define MODEL_NUM						"One Card Example"							/**< Model number. Will be passed to Device Information Service. */
#define SERIAL_NUM						"0000-0000-0000"							/**< Serial number. Will be passed to Device Information Service. */
#define HW_REV							"13.0.0"									/**< hardware revision. Will be passed to Device Information Service. */
#define FW_REV							"13.0.0"									/**< firmware revision. Will be passed to Device Information Service. */
#define SW_REV							"0.0.1"										/**< software revision. Will be passed to Device Information Service. */

/*
 * ble : service
 *     # Diverta OneCard Service.
 */
#define SERIAL_CODE_BASE				"12345678"
#define SERIAL_CODE_BLANK				"000000000000"

#define SERIAL_CODE_LEN					BLE_ONE_CARD_SERIAL_CODE_LEN

/*
 * MagStripeData Library.
 */
#define MAGSTRIPEDATA_SYNC_BIT_LENGTH		8											//!< 8 or 100?
#define MAGSTRIPEDATA_F2F_PULSE_WIDTH_US	100											//!< F2F Pulse width(us).
#define MAGSTRIPEDATA_TRIGGER_DELAY_MS		50											//!< Trigger delay.


/*******************************************************************************
 * function prototype.
 ******************************************************************************/
/*
 * log.
 */
static void log_init(void);

/*
 * timer.
 */
static void timers_init(void);
static void timers_start(void);
static void on_no_operation_timer_timeout(void *p_context);
static void on_trigger_disabled_timer_timeout(void *p_context);
static void on_card_sync_timer_timeout(void *p_context);
static void on_seq_req_timer_timeout(void *p_context);
static void on_app_button_long_push_timer_timeout(void *p_context);


/*
 * gpiote.
 */
static void gpiote_init(void);
static void gpiote_power_cont(void);
static void gpiote_drive_trigger(void);

/*
 * button.
 */
static void buttons_init(void);
static void on_button_evt(uint8_t pin_no, uint8_t button_action);

/*
 * peer manager.
 */
static void peer_manager_init(bool erase_bonds);
static void on_pm_evt(pm_evt_t const * p_evt);

/*
 * ble.
 */
static void ble_stack_init(void);
static void ble_gap_init(void);
static void ble_gatt_init(void);
static void ble_services_init(void);
static void ble_conn_init(void);
static void ble_adv_init(void);
static void ble_adv_start(void);
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt);
static void on_conn_params_error_handler(uint32_t nrf_error);
static void on_adv_evt(ble_adv_evt_t ble_adv_evt);
static void on_ble_evt(ble_evt_t * p_ble_evt);
static void on_one_card_evt(uint16_t evt_id);

/*
 * power save.
 */
static void power_manage(void);
static void sleep_mode_enter(void);

/*
 * MagStripeData.
 */
static void magstripedata_init(void);
static void magstripedata_switch_card_selection(void);
static void magstripedata_transfer(uint8_t card_type, const uint8_t *p_card_code, uint16_t card_code_len);
static bool magstripedata_is_available_card(void);

/*
 * Serial Code.
 */
static void serial_code_generate(void);
static uint8_t serial_code_compare(const uint8_t *p_expected, const uint8_t *p_actual);


/*******************************************************************************
 * static fields.
 ******************************************************************************/
APP_TIMER_DEF(m_no_operation_timer_id);                                             /**< No Operation timer. */
APP_TIMER_DEF(m_trigger_disabled_timer_id);                                         /**< Trigger Disabled timer. */
APP_TIMER_DEF(m_card_sync_timer_id);                                                /**< Card sync timer. */
APP_TIMER_DEF(m_sec_req_timer_id);                                                  /**< Security Request timer. */
APP_TIMER_DEF(m_long_push_timer_id);                                                /**< Button long push timer. */

static int m_no_operation_timer_sec = 0;
static int m_trigger_disabled_timer_sec = 0;
static int m_card_sync_timer_sec = 0;

static const app_button_cfg_t m_app_buttons[APP_BUTTON_NUM] = {
	{PIN_SCAN_SW_IN, APP_BUTTON_ACTIVE_HIGH, NRF_GPIO_PIN_PULLDOWN, on_button_evt},
	{PIN_MAIN_SW_IN, APP_BUTTON_ACTIVE_LOW , NRF_GPIO_PIN_PULLUP  , on_button_evt}
};

static bool m_long_pushed = false;

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                            /**< Handle of the current connection. */
static nrf_ble_gatt_t m_gatt;                                                       /**< GATT module instance. */

static pm_peer_id_t m_peer_to_be_deleted = PM_PEER_ID_INVALID;

// YOUR_JOB: Use UUIDs for service(s) used in your application.
static ble_uuid_t m_adv_uuids[] = {
	//{BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE         },
	{BLE_UUID_ONE_CARD_SERVICE          , BLE_UUID_TYPE_VENDOR_BEGIN}
};                                                                                  /**< Universally unique service identifiers. */

/* YOUR_JOB: Declare all services structure your application is using
   static ble_xx_service_t                     m_xxs;
   static ble_yy_service_t                     m_yys;
 */
static const ble_one_card_t *m_ble_one_card = NULL;                                 /**< One Card Service. */

static uint8_t m_serial_code[SERIAL_CODE_LEN + 1];
static uint8_t m_serial_retry_count = 0;


