diverta/onecard-fido/nRF5_SDK_v13.0.0/examples/diverta/one_card_peripheral_app/main.c
            if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID) {
                if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL)) {
                    if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE) {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                    }
                    else {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                    }
                    auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
                    err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                               &auth_reply);
                    APP_ERROR_CHECK(err_code);
                }
            }
        }
		break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST

        default:
            // No implementation needed.
            break;
    }
}

/**
 * @brief One Card Service イベントハンドラ
 *
 * @param[in]	evt_id	イベントID.
 */
static void on_one_card_evt(uint16_t evt_id)
{
	ret_code_t err_code;
	
	NRF_LOG_INFO("[APP]on_one_card_evt(%d).\r\n", evt_id);
	
	switch (evt_id) {
	case BLE_ONE_CARD_EVT_SYNC_CARD_NO_WRITE:
		{
			uint8_t sync_card_no;
			sync_card_no = ble_one_card_sync_card_no(m_ble_one_card);
			NRF_LOG_INFO("[APP]Sync Card Number : %#x.\r\n", sync_card_no);
			
			if (sync_card_no <= CARD_LIST_NUM - 1) {
				card_manager_set_sync_card_no(sync_card_no);
			}
			else {
				NRF_LOG_WARNING("[APP]Invalid Card Number!!\r\n");
			}
			
			// No Operation Timer Reset.
			if (0 < m_no_operation_timer_sec) {
				m_no_operation_timer_sec = NO_OPERATION_TIME_OUT_SEC;
			}
		}
		break;
		
	case BLE_ONE_CARD_EVT_CARD_CODE_WRITE:
		{
			const uint8_t	*p_card_code_str = NULL;
			uint16_t		card_code_len = 0;
			ble_one_card_card_code(m_ble_one_card, &p_card_code_str, &card_code_len);
			NRF_LOG_INFO("[APP]Card Code : %s.\r\n", (uint32_t)p_card_code_str);

			card_manager_set_card_code(p_card_code_str, card_code_len);
			
			// No Operation Timer Reset.
			if (0 < m_no_operation_timer_sec) {
				m_no_operation_timer_sec = NO_OPERATION_TIME_OUT_SEC;
			}
		}
		break;
		
	case BLE_ONE_CARD_EVT_CARD_TYPE_WRITE:
		{
			uint8_t card_type;
			card_type = ble_one_card_card_type(m_ble_one_card);
			NRF_LOG_INFO("[APP]Card Type : %#x.\r\n", card_type);

			if ((ONECARD_TRACK_1 <= card_type) && (card_type <= ONECARD_JIS_2)) {
				card_manager_set_card_type(card_type);
			}
			else {
				NRF_LOG_WARNING("[APP]Invalid Card Type!!\r\n");
			}
			
			// No Operation Timer Reset.
			if (0 < m_no_operation_timer_sec) {
				m_no_operation_timer_sec = NO_OPERATION_TIME_OUT_SEC;
			}
		}
		break;
		
	case BLE_ONE_CARD_EVT_CARD_TITLE_WRITE:
		{
			const uint8_t	*p_card_title_str = NULL;
			uint16_t		card_title_len = 0;
			ble_one_card_card_title(m_ble_one_card, &p_card_title_str, &card_title_len);
			NRF_LOG_INFO("[APP]Card Title : %s.\r\n", (uint32_t)p_card_title_str);

			card_manager_set_card_title(p_card_title_str, card_title_len);
			
			// No Operation Timer Reset.
			if (0 < m_no_operation_timer_sec) {
				m_no_operation_timer_sec = NO_OPERATION_TIME_OUT_SEC;
			}
		}
		break;
		
	case BLE_ONE_CARD_EVT_CARD_SUB_TITLE_WRITE:
		{
			const uint8_t	*p_card_sub_title_str = NULL;
			uint16_t		card_sub_title_len = 0;
			ble_one_card_card_sub_title(m_ble_one_card, &p_card_sub_title_str, &card_sub_title_len);
			NRF_LOG_INFO("[APP]Card Sub Title : %s.\r\n", (uint32_t)p_card_sub_title_str);
			
			card_manager_set_card_subtitle(p_card_sub_title_str, card_sub_title_len);
			
			// No Operation Timer Reset.
			if (0 < m_no_operation_timer_sec) {
				m_no_operation_timer_sec = NO_OPERATION_TIME_OUT_SEC;
			}
		}
		break;
		
	case BLE_ONE_CARD_EVT_LOCK_TIME_WRITE:
		{
			// No Operation Timer Reset.
			if (0 < m_no_operation_timer_sec) {
				m_no_operation_timer_sec = NO_OPERATION_TIME_OUT_SEC;
			}
		}
		break;
		
	case BLE_ONE_CARD_EVT_SERIAL_CODE_WRITE:
		{
			const uint8_t *p_card_serial_code_str = NULL;
			uint16_t card_serial_code_len = 0;
			ble_one_card_serial_code(m_ble_one_card, &p_card_serial_code_str, &card_serial_code_len);
			NRF_LOG_INFO("[APP]Serial Code : %s.\r\n", (uint32_t)p_card_serial_code_str);
			
			// verify serial code.
			if (serial_code_compare(p_card_serial_code_str, (const uint8_t*)m_serial_code) == 0) {
				NRF_LOG_INFO("[APP]Verify Serial Code.\r\n");
			}
			else {
				NRF_LOG_WARNING("[APP]Invalid Serial Code.\r\n");
				
				// increment the retry count.
				m_serial_retry_count++;
				
				// retry count is over?
				if (2 < m_serial_retry_count) {
					// TODO
				}
			}
			
			// cleanup.
			ble_one_card_set_serial_code(m_ble_one_card, (uint8_t*)SERIAL_CODE_BLANK, SERIAL_CODE_LEN);
			
			// No Operation Timer Reset.
			if (0 < m_no_operation_timer_sec) {
				m_no_operation_timer_sec = NO_OPERATION_TIME_OUT_SEC;
			}
		}
		break;
		
	case BLE_ONE_CARD_EVT_RX_WRITE:
		{
			const uint8_t *p_rx_str = NULL;
			uint16_t rx_len = 0;
			ble_one_card_rx(m_ble_one_card, &p_rx_str, &rx_len);
			NRF_LOG_INFO("[APP]Rx : %s.\r\n", (uint32_t)p_rx_str);
			
			// No Operation Timer Reset.
			if (0 < m_no_operation_timer_sec) {
				m_no_operation_timer_sec = NO_OPERATION_TIME_OUT_SEC;
			}
		}
		
	default:
		break;
	}
}


/**
 * @brief Timer event handler.
 *
 * @param[in]   p_context
 */
static void on_no_operation_timer_timeout(void *p_context)
{
	gpiote_power_cont();

	// count down.
	if (0 < m_no_operation_timer_sec) {
		m_no_operation_timer_sec--;
		NRF_LOG_INFO("[APP]No operation timer timeout(%d).\r\n", m_no_operation_timer_sec);
		// time up.
		if (m_no_operation_timer_sec == 0) {
			// TODO
		}
	}
}

/**
 * @brief Timer event handler.
 *
 * @param[in]   p_context
 */
static void on_trigger_disabled_timer_timeout(void *p_context)
{
    // count down.
    if (0 < m_trigger_disabled_timer_sec) {
        m_trigger_disabled_timer_sec--;
        NRF_LOG_INFO("[APP]Trigger disabled timer timeout(%d).\r\n", m_trigger_disabled_timer_sec);
    }
}

/**
 * @brief Timer event handler.
 *
 * @param[in]   p_context
 */
static void on_card_sync_timer_timeout(void *p_context)
{
	// count down.
	if (0 < m_card_sync_timer_sec) {
		m_card_sync_timer_sec--;
		NRF_LOG_INFO("[APP]Card sync timer timeout(%d).\r\n", m_card_sync_timer_sec);
		// time up.
		if (m_card_sync_timer_sec == 0) {
			// TODO
		}
	}
}

/**
 * @brief Timer event handler.
 *
 * @param[in]   p_context
 */
static void on_seq_req_timer_timeout(void *p_context)
{
    ret_code_t err_code;

    if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {
        // Initiate bonding.
        NRF_LOG_INFO("[APP]Start encryption.\r\n");
        err_code = pm_conn_secure(m_conn_handle, false);
        if (err_code != NRF_ERROR_INVALID_STATE) {
            APP_ERROR_CHECK(err_code);
        }
    }
}

/**
 * @brief Timer event handler.
 *
 * @param[in]   p_context
 */
static void on_long_push_timer_timeout(void *p_context)
{
	NRF_LOG_INFO("[APP]Button long pushed.\r\n");

	m_long_pushed = true;
	on_button_evt(PIN_MAIN_SW_IN, APP_BUTTON_ACTION_LONG_PUSH);
}

/**
 * @brief Button event handler.
 *
 * @param[in]   pin_no
 * @param[in]   button_action
 */
static void on_button_evt(uint8_t pin_no, uint8_t button_action)
{
	ret_code_t err_code;

	switch (button_action) {
	case APP_BUTTON_ACTION_PUSH:
		{
			NRF_LOG_INFO("[APP]Button pushed(%d).\r\n", pin_no);
			if (pin_no == PIN_SCAN_SW_IN) {
				// do nothing...
			}
			else if (pin_no == PIN_MAIN_SW_IN) {
					err_code = app_timer_start(m_long_push_timer_id, LONG_PUSH_TIMEOUT, NULL);
					APP_ERROR_CHECK(err_code);
				}
			else {
				// do nothing...
			}

			// No Operation Timer Reset.
			if (0 < m_no_operation_timer_sec) {
				m_no_operation_timer_sec = NO_OPERATION_TIME_OUT_SEC;
			}
		}
		break;
		
	case APP_BUTTON_ACTION_RELEASE:
		{
			NRF_LOG_INFO("[APP]Button released(%d).\r\n", pin_no);

			if (m_long_pushed) {
				m_long_pushed = false;
				break;
			}
			if (pin_no == PIN_SCAN_SW_IN) {
				// Swipe待機
				// is available card?
				if (magstripedata_is_available_card()) {
					if (m_trigger_disabled_timer_sec == 0) {
						// head detected -> drive trigger.
						gpiote_drive_trigger();
						
