diverta/onecard-fido/nRF5_SDK_v13.0.0/examples/diverta/one_card_peripheral_app/main.c
						// trigger disabled timer.
						m_trigger_disabled_timer_sec = TRIGGER_DISABLED_TIME_OUT_SEC;
						err_code = app_timer_start(m_trigger_disabled_timer_id, TRIGGER_DISABLED_TIMER_INTERVAL, NULL);
						APP_ERROR_CHECK(err_code);
					}
				}
			}
			else if (pin_no == PIN_MAIN_SW_IN) {
				// timer stop.
				app_timer_stop(m_long_push_timer_id);
				// switch the current card selection.
				magstripedata_switch_card_selection();
			}
			else {
				// do nothing...
			}

			// No Operation Timer Reset.
			if (0 < m_no_operation_timer_sec) {
				m_no_operation_timer_sec = NO_OPERATION_TIME_OUT_SEC;
			}
		}
		break;
		
	case APP_BUTTON_ACTION_LONG_PUSH:
		{
			if (pin_no == PIN_SCAN_SW_IN) {
				// not supported...
			}
			else if (pin_no == PIN_MAIN_SW_IN) {
			}
			else {
				// do nothing...
			}
			
			// No Operation Timer Reset.
			if (0 < m_no_operation_timer_sec) {
				m_no_operation_timer_sec = NO_OPERATION_TIME_OUT_SEC;
			}
		}
		break;
		
	default:
		// do nothing...
		break;
	}
}

/*******************************************************************************
 * private functions.
 ******************************************************************************/
/**
 * @brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    ret_code_t err_code;

    // Initialize timer module.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create no operation timer.
    err_code = app_timer_create(&m_no_operation_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                on_no_operation_timer_timeout);
    APP_ERROR_CHECK(err_code);
    
    // Create trigger disabled timer.
    err_code = app_timer_create(&m_trigger_disabled_timer_id,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                on_trigger_disabled_timer_timeout);
    APP_ERROR_CHECK(err_code);
    
    // Create card sync timer.
    err_code = app_timer_create(&m_card_sync_timer_id,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                on_card_sync_timer_timeout);
    APP_ERROR_CHECK(err_code);
    
    // Create security request timer.
    err_code = app_timer_create(&m_sec_req_timer_id,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                on_seq_req_timer_timeout);
    APP_ERROR_CHECK(err_code);
    
    // Create card sync timer.
    err_code = app_timer_create(&m_long_push_timer_id,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                on_long_push_timer_timeout);
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief Function for initializing the GPIOTE handler module.
 */
static void gpiote_init(void)
{
    // GPIO pin Setting
    nrf_gpio_cfg_output(PIN_PWR_CONT_OUT);
    nrf_gpio_cfg_output(PIN_DRV_TRIG_OUT);

    //nrf_gpiote_task_configure(APP_GPIOTE_CHANNEL_0, PIN_PWR_CONT_OUT, NRF_GPIOTE_POLARITY_TOGGLE, NRF_GPIOTE_INITIAL_VALUE_LOW);
    //nrf_gpiote_task_configure(APP_GPIOTE_CHANNEL_0, PIN_DRV_TRIG_OUT, NRF_GPIOTE_POLARITY_TOGGLE, NRF_GPIOTE_INITIAL_VALUE_LOW);
}

/**
 * @brief Power on continue.
 */
static void gpiote_power_cont(void)
{
    nrf_gpio_pin_set(PIN_PWR_CONT_OUT);
    nrf_delay_ms(2);
    nrf_gpio_pin_clear(PIN_PWR_CONT_OUT);
}

/**
 * @brief Drive trigger.
 */
static void gpiote_drive_trigger(void)
{
	// Drive Trigger.
	nrf_gpio_pin_set(PIN_DRV_TRIG_OUT);
	nrf_delay_ms(2);
	nrf_gpio_pin_clear(PIN_DRV_TRIG_OUT);
}

/**
 * @brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    ret_code_t err_code;

    err_code = app_button_init((app_button_cfg_t*)m_app_buttons, APP_BUTTON_NUM, APP_BUTTON_DELAY);
    APP_ERROR_CHECK(err_code);

    err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting timers.
 */
static void timers_start(void)
{
    /* YOUR_JOB: Start your timers. below is an example of how to start a timer.
       uint32_t err_code;
       err_code = app_timer_start(m_app_timer_id, TIMER_INTERVAL, NULL);
       APP_ERROR_CHECK(err_code); */
	
    ret_code_t err_code;

    // no operation timer.
	m_no_operation_timer_sec = NO_OPERATION_TIME_OUT_SEC;
    err_code = app_timer_start(m_no_operation_timer_id, NO_OPERATION_TIMER_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

}

/**@brief Function for the Peer Manager initialization.
 *
 * @param[in] erase_bonds  Indicates whether bonding information should be cleared from
 *                         persistent storage during initialization of the Peer Manager.
 */
static void peer_manager_init(bool erase_bonds)
{
    ble_gap_sec_params_t sec_param;
    ret_code_t           err_code;

    err_code = pm_init();
    APP_ERROR_CHECK(err_code);

    if (erase_bonds) {
        err_code = pm_peers_delete();
        APP_ERROR_CHECK(err_code);
    }

    memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

#if 0
    // Security parameters to be used for all security procedures.
    sec_param.bond           = SEC_PARAM_BOND;
    sec_param.mitm           = SEC_PARAM_MITM;
    sec_param.lesc           = SEC_PARAM_LESC;
    sec_param.keypress       = SEC_PARAM_KEYPRESS;
    sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
    sec_param.oob            = SEC_PARAM_OOB;
    sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
    sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
    sec_param.kdist_own.enc  = 1;
    sec_param.kdist_own.id   = 1;
    sec_param.kdist_peer.enc = 1;
    sec_param.kdist_peer.id  = 1;
#else
    /* Passkey bonding with keyboard capabilities: */
    sec_param.bond              = 1;
    sec_param.mitm              = 1;
    sec_param.lesc              = 0;
    sec_param.keypress          = 0;
    sec_param.io_caps           = BLE_GAP_IO_CAPS_DISPLAY_ONLY;
    sec_param.oob               = 0;
    sec_param.min_key_size      = SEC_PARAM_MIN_KEY_SIZE;
    sec_param.max_key_size      = SEC_PARAM_MAX_KEY_SIZE;
    sec_param.kdist_own.enc     = 1;
    sec_param.kdist_own.id      = 1;
    sec_param.kdist_peer.enc    = 1;
    sec_param.kdist_peer.id     = 1;
#endif

    err_code = pm_sec_params_set(&sec_param);
    APP_ERROR_CHECK(err_code);

