diverta/onecard-fido/nRF5_SDK_v13.0.0/examples/diverta/one_card_peripheral_app/main.c
    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the Advertising functionality.
 */
static void ble_adv_init(void)
{
    ret_code_t             err_code;
    ble_advdata_t          advdata;
    ble_adv_modes_config_t options;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = true;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    advdata.uuids_complete.p_uuids  = m_adv_uuids;

    memset(&options, 0, sizeof(options));
    options.ble_adv_fast_enabled  = true;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}

/*
 * @brief Function for starting advertising.
 */
static void ble_adv_start(void)
{
    ret_code_t err_code = ble_advertising_start(BLE_ADV_MODE_FAST);

    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    ret_code_t err_code = sd_app_evt_wait();

    APP_ERROR_CHECK(err_code);
}

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    ret_code_t err_code;

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief Function for initializing the MagStripeData Library.
 */
static void magstripedata_init(void)
{
	card_manager_init();
	
    MagStripeData_init();
    MagStripeData_setSyncBitLength(MAGSTRIPEDATA_SYNC_BIT_LENGTH);
    MagStripeData_setTrackNumber(JIS_2);    // 仮
    MagStripeData_encode();                 // 仮
}

/**
 * @brief Function for switch the current card selection.
 */
static void magstripedata_switch_card_selection(void)
{
	bool	available_card	= false;
	uint8_t	card_num		= CARD_LIST_NUM;
	uint8_t	current_card_no = card_manager_selected_card_no();
	
	const card_info_t *p_selected_card = NULL;
	
	do {
		// current card info.
		p_selected_card = card_manager_selected_card_info(current_card_no);
		if (p_selected_card) {
			// available card?
			if (p_selected_card->card_type != ONECARD_UNUSED) {
				available_card = true;
				break;
			}
			// this card is emply.
			else {
				// find the next card.
				if (current_card_no + 1 < CARD_LIST_NUM) {
					current_card_no++;
				}
				else {
					// skip to #0.
					current_card_no = 1;
				}
			}
		}
		else {
			NRF_LOG_WARNING("[APP]Invalid card info.\r\n");
		}
	} while (card_num--);
	
	// no available card, is set #1.
	if (!available_card) {
		current_card_no = 1;
		
		p_selected_card = card_manager_selected_card_info(current_card_no);
	}
	
	// update selected card no.
	card_manager_set_selected_card_no(current_card_no);
	
	// Attribute value の更新.
	// # Selected Card Number.
	ble_one_card_set_selected_card_no(m_ble_one_card, current_card_no);
	NRF_LOG_INFO("[APP]current card no: %d\r\n", current_card_no);
	
	// transfer the MagstripeData.
	magstripedata_transfer(p_selected_card->card_type, 
						   p_selected_card->card_code.value, 
						   p_selected_card->card_code.len);
}

/**
 * @brief Function for transfer the MagStripeData.
 *
 * @param[in]	card_type			card type.
 * @param[in]	p_card_code			card code string.
 * @param[in]	card_code_len		card code length.
 */
static void magstripedata_transfer(uint8_t card_type, 
								   const uint8_t *p_card_code, 
								   uint16_t card_code_len)
{
	// Magstripe Data.
	MagStripeData_clear();
	MagStripeData_setTrackNumber((TrackNumber)card_type);
	for (int i = 0; i < card_code_len; i++) {
		if (p_card_code[i] != 0) {
			MagStripeData_add(p_card_code[i]);
		}
	}
	MagStripeData_encode();
	
	// F2F Data.
	unsigned char	*p_f2fdata			= MagStripeData_getF2FDataAddr();
	int				f2fdata_bit_len		= MagStripeData_getF2FDataBitLength();
	int				f2fdata_byte_len	= f2fdata_bit_len / 8;
	if ((f2fdata_bit_len % 8) != 0) {
		f2fdata_byte_len++;
	}
	NRF_LOG_INFO("[APP]f2f data bit  len : %d\r\n", f2fdata_bit_len);
	NRF_LOG_INFO("[APP]f2f data byte len : %d\r\n", f2fdata_byte_len);

	// transfer the F2F data via SPI.
	if (0 < f2fdata_byte_len) {
		//one_card_spi_master_init();
		one_card_spi_master_set_tx_data((uint8_t *)p_f2fdata, (uint16_t)f2fdata_byte_len);
		one_card_spi_master_transfer();
	}
}

/**
 * @brief Function for current card is available.
 */
static bool magstripedata_is_available_card(void)
{
	bool	is_available_card	= false;
	uint8_t current_card_no = card_manager_selected_card_no();
	NRF_LOG_INFO("[APP]current card no: %d\r\n", current_card_no);
	
	const card_info_t *p_selected_card = card_manager_selected_card_info(current_card_no);
	if (p_selected_card) {
		// available card?
		if (p_selected_card->card_type != ONECARD_UNUSED) {
			is_available_card = true;
		}
	}
	
	return is_available_card;
}

/**
 * @brief Function for generate the serial code.
 */
static void serial_code_generate(void)
{
	uint8_t code[12];
	memcpy(m_serial_code, SERIAL_CODE_BASE, SERIAL_CODE_LEN - 4);
	
	code[0] = m_serial_code[0] - '0';
	code[1] = m_serial_code[1] - '0';
	code[2] = m_serial_code[2] - '0';
	code[3] = m_serial_code[3] - '0';
	code[4] = m_serial_code[4] - '0';
	code[5] = m_serial_code[5] - '0';
	code[6] = m_serial_code[6] - '0';
	code[7] = m_serial_code[7] - '0';
	
	code[8] = (code[0] + code[2] + code[4] + code[6]) % 10;
	code[9] = (code[1] + code[3] + code[5] + code[7]) % 10;
	code[10] = (code[0] + code[1] + code[2] + code[3]) % 10;
	code[11] = (code[4] + code[5] + code[6] + code[7]) % 10;
	
	m_serial_code[8] = code[8] + '0';
	m_serial_code[9] = code[9] + '0';
	m_serial_code[10] = code[10] + '0';
	m_serial_code[11] = code[11] + '0';
	m_serial_code[12] = 0;
	
	NRF_LOG_INFO("[APP]Serial Code : %s.\r\n", (uint32_t)m_serial_code);
}

/**
 * @brief Function for compare the serial code.
 *
 * @param[in]	p_expected	expected serial code.
 * @param[in]	p_actual	actual serial code.
 */
static uint8_t serial_code_compare(const uint8_t *p_expected, const uint8_t *p_actual)
{
	uint8_t ret = 0;
	
	for (int i = 0; i < SERIAL_CODE_LEN; i++) {
		if (p_expected[i] != p_actual[i]) {
			ret++;
		}
	}
	
	return ret;
}

/**
 * @}
 */
